# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSet..::..Insert Method
GroupSet Class See Also
---
Insert the specified group into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	Group item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As Group _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	Group^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..GroupThe group to be inserted into the set.
# ### Return Value
Returns whether the group was inserted into the set.
# See Also
GroupSet Class
Autodesk.Revit.DB Namespace